---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.GetStringValue
source: html/1bd344af-4984-367d-f8a6-769f7fb0d093.htm
---
# Autodesk.Revit.DB.ScheduleFilter.GetStringValue Method

Gets the filter value for a filter using a string value.

## Syntax (C#)
```csharp
public string GetStringValue()
```

## Returns
The filter value.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The filter value is not a string.